from tools import *
from graphics import *
import pandas as pd
from preformatting_data import preformat

"""
Базовый анализ факторов возникновения ОПП у пациентов (те, которые считаются важными)
"""

data = preformat(pd.read_csv('medics_1.csv', delimiter=',', encoding='utf-8'))

# посмотрим на названия столбцов
print(data.columns)
print('-------------------------------------------------')

# выведем первые несколько элементов, чтобы ознакомиться с датасетом
print(data.head())
print('-------------------------------------------------')

# обратим внимания на типы данных
print(data.info())

print('-------------------------------------------------')

# построение матрицы корреляций
plt.figure(figsize=(16, 16))
sns.set(style="whitegrid")
correlation_matrix = data.corr()
sns.heatmap(correlation_matrix, cmap='coolwarm')
plt.show()

for factor1 in ["хбп", "возраст", "сахарный_диабет", "гб", "сад", "дад", "чсс", "рн", "фракция_изгнания", "холестерин",
                "креатинин_крови", "мочевина", "скф_расч", "калий", "имт", "толщина_паренхимы_почек", "аик",
                "количество_шунтов", "длительность_аик", "длительность_операции", "время_пережатия_аорты",
                "объем_кровопотерии", "объем_гемотрансфузии", "объем_инфузий", "диурез"]:

    # посмотрим на базовые метрики факторов
    if factor1 not in ["хбп", "сахарный_диабет", "гб", "аик", "объем_гемотрансфузии",
                       "длительность_аик", "время_пережатия_аорты"]:
        print(pd.DataFrame(round(data[factor1].describe().T, 2)))
        print('-------------------------------------------------')
        viz_data_hist_s(data, factor1)

    # визуализируем данные:
    if factor1 in ["хбп", "сахарный_диабет", "гб", "аик"]:
        viz_data_pie(data, factor1)

